/*****************************************************************************
* Copyright (C) 2010
* All rights reserved.
* 所属组件 : AS
* 模块名称 : ASXAxDIAG
* 文件名称 : ASXAxDIAG_tc.h
* 概要描述 :
*	AS组件ASXAxDIAG数据结构定义
* 历史记录 :
* 版本    日期    作者    内容
*****************************************************************************/
#ifndef _ASXAxDIAG_TC_H_
#define _ASXAxDIAG_TC_H_

/*------------------------------- Includes -------------------------------*/



/*-------------------------------- Defines -------------------------------*/



/*-------------------------- Enums and Structs ---------------------------*/



/*--------------------DD Interfaces --------------------*/

//TBD函数返回值类型、参数传值or指针不确定-_-
int ASXAxDIAG_log_generic_params(void);



#endif // _ASXAxDIAG_TC_H_
