/*****************************************************************************
* Copyright (C) 2010
* All rights reserved.
* 所属组件 : AS
* 模块名称 : ASXAxDESA
* 文件名称 : ASXAxDESA_tc.h
* 概要描述 :
*	AS组件ASXAxDESA数据结构定义
* 历史记录 :
* 版本    日期    作者    内容
*****************************************************************************/
#ifndef _ASXAxDESA_TC_H_
#define _ASXAxDESA_TC_H_

/*------------------------------- Includes -------------------------------*/



/*-------------------------------- Defines -------------------------------*/



/*-------------------------- Enums and Structs ---------------------------*/



/*--------------------DD Interfaces --------------------*/

//TBD函数返回值类型、参数传值or指针不确定-_-
int ASXAxDESA_off(void);
int ASXAxDESA_restore(void);



#endif // _ASXAxDESA_TC_H_
