/*****************************************************************************
* Copyright (C) 2010
* All rights reserved.
* 所属组件 : AV
* 模块名称 : AVXPMX
* 文件名称 : AVXPMX_tc.h
* 概要描述 :
*	AV组件AVXPMX数据结构定义
* 历史记录 :
* 版本    日期    作者    内容
*****************************************************************************/
#ifndef _AVXPMX_TC_H_
#define _AVXPMX_TC_H_

/*------------------------------- Includes -------------------------------*/
#include <MBXA_tc.h> 



/*-------------------------------- Defines -------------------------------*/



/*-------------------------- Enums and Structs ---------------------------*/



#endif // _AVXPMX_TC_H_
