/*****************************************************************************
* Copyright (C) 2010
* All rights reserved.
* 产品号 : 
* 所属组件 : EH
* 模块名称 : EHXA
* 文件名称 : EHXA.h
* 概要描述 :
*	EH组件EHXA对外接口声明
* 历史记录 :
* 版本    日期    作者    内容
* 1.0
*****************************************************************************/
#ifndef _EHXA_H_ 
#define _EHXA_H_

/*-------------------- 头文件 --------------------*/
#include <base.h>



/*-------------------- 宏定义 --------------------*/



/*------------------------ 结构体 ------------------------*/


/*-------------------- 对外全局变量声明 --------------------*/








/*----------------------- 对外接口声明 -----------------------*/


int EHXA_main_loop(void);
int EHXA_add_timeout(double dParam1, void *pParam2, _VOID_PTR_ pParam3, int *piParam4, _VOID_PTR_ pParam5);
int EHXA_remove_event(int *piParam1);           //add by jiangshan





#endif // _EHXA_H_

