/*****************************************************************************
* Copyright (C) 2010
* All rights reserved.
* 产品号 : 
* 所属组件 : MS
* 模块名称 : MSXA
* 文件名称 : MSXA.h
* 概要描述 :
*	MS组件MSXA对外接口声明
* 历史记录 :
* 版本    日期    作者    内容
* 1.0
*****************************************************************************/
#ifndef _MSXA_H_ 
#define _MSXA_H_

#include <base.h>


/*-------------------- 对外全局变量声明 --------------------*/








/*----------------------- 对外接口声明 -----------------------*/


//TBD函数返回值类型、参数传值or指针不确定-_-
int MSXA_req_DHMI_control(void);





#endif // _MSXA_H_

