/*****************************************************************************
* Copyright (C) 2010
* All rights reserved.
* 所属组件 : IM
* 模块名称 : IMCCxDC
* 文件名称 : IMCCxDC_tc.h
* 概要描述 :
*	IM组件IMCCxDC数据结构定义
* 历史记录 :
* 版本    日期    作者    内容
*****************************************************************************/
#ifndef _IMCCxDC_TC_H_
#define _IMCCxDC_TC_H_

/*------------------------------- Includes -------------------------------*/



/*-------------------------------- Defines -------------------------------*/



/*-------------------------- Enums and Structs ---------------------------*/



#endif // _IMCCxDC_TC_H_
