/*****************************************************************************
* Copyright (C) 2010
* All rights reserved.
* 所属组件 : IM
* 模块名称 : IMIFXPMX
* 文件名称 : IMIFXPMX_tc.h
* 概要描述 :
*	IM组件IMIFXPMX数据结构定义
* 历史记录 :
* 版本    日期    作者    内容
*****************************************************************************/
#ifndef _IMIFXPMX_TC_H_
#define _IMIFXPMX_TC_H_

/*------------------------------- Includes -------------------------------*/
#include <MBXA_tc.h> 



/*-------------------------------- Defines -------------------------------*/



/*-------------------------- Enums and Structs ---------------------------*/



#endif // _IMIFXPMX_TC_H_
