/*****************************************************************************
* Copyright (C) 2010
* All rights reserved.
* 所属组件 : IM
* 模块名称 : IMZD_TC
* 文件名称 : IMZD_TC_tc.h
* 概要描述 :
*	IM组件IMZD_TC数据结构定义
* 历史记录 :
* 版本    日期    作者    内容
*****************************************************************************/
#ifndef _IMZD_TC_TC_H_
#define _IMZD_TC_TC_H_

/*------------------------------- Includes -------------------------------*/
#include <IMZD_DC_tc.h> 



/*-------------------------------- Defines -------------------------------*/



/*-------------------------- Enums and Structs ---------------------------*/

typedef struct
{
    IMZD_DC_dc_struct dc_struct;
} IMZD_TC_tc_struct;



#endif // _IMZD_TC_TC_H_
