/*****************************************************************************
* Copyright (C) 2010
* All rights reserved.
* 产品号 :
* 所属组件 : CC
* 模块名称 : CCYY
* 文件名称 : CCYY_extern.h
* 概要描述 :
*   未在参考头文件中找到的libCCYY模块使用到外部数据类型及接口定义
* 历史记录 :
* 版本    日期    作者    内容
* 1.0
*****************************************************************************/
#ifndef _CCYY_extern_H_ 
#define _CCYY_extern_H_


//未在参考头文件中找到的libCCYY模块使用到外部数据类型及接口定义

/*-------------------- 头文件 --------------------*/
#include <base.h>



/*-------------------- 宏定义 --------------------*/







/*----------------------- 枚举定义 -----------------------*/







/*------------------------ 结构体 ------------------------*/









/*----------------------- 函数声明 -----------------------*/









#endif // _CCYY_extern_H_
