/*****************************************************************************
* Copyright (C) 2010
* All rights reserved.
* 产品号 : 
* 所属组件 : CC
* 模块名称 : CCXX
* 文件名称 : CCXX.c
* 概要描述 :
*	
* 历史记录 :
* 版本    日期    作者    内容
* 1.0
*****************************************************************************/
#include "CCXX.h"
#include "CCXX_extern.h"


/*----------------------- 外部变量声明 -----------------------*/




/*----------------------- 外部函数声明 -----------------------*/





/*----------------------- 全局变量声明 -----------------------*/





/*----------------------- 静态函数声明 -----------------------*/












/*----------------------- 函数实现 -----------------------*/
/**
* Include:
*	<CCXX.h>
* Function:
*	
* Parameters:
* 	-input:
*		<none>
* 	-input/output:
*		<none>
*	-output:
*		<none>
* Returns:
*	OK
*	
* Description:
*	
*/
int CCXX_function1(void)
{
	int iErrorCode = 0;
	char *psErrorText = NULL;


	return iErrorCode;
}














